//
//  A12.c
//  c
//
//  Created by Xinyu Zhang on 10.09.2021.
//
//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永无BUG
//


#include <stdio.h>

int main(int argc, const char * argv[]) {
    int num=-1, digit, flag = 0;
    scanf("%d", &num);
    if (num != 0)
    {
        while(num)
        {
            digit = num%10;
            num /= 10;
            if (digit > num%10)
                continue;
            else
            {
                printf("NO\n");
                flag = 1;
                break;
            }
        }
        if (flag == 0)
            printf("YES\n");
    }
    else
        printf("YES\n");

    return 0;
}
