//
//  C12.c
//  c
//
//  Created by Xinyu Zhang on 12.10.2021.
//
//
//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永无BUG
//
//
//
//
#include <stdio.h>
void prevero(const char *sent)
{
    int flag = 0;
    for (int i = 0; sent[i]; i++)
    {
        if (sent[i] != ' ')
        {
            printf("%c", sent[i]);
            flag = 1;
        }
        else if (sent[i] == ' ' && flag == 1)
        {
            printf("\n");
            flag = 0;
        }
    }
    printf("\n");
}

int main(int argc, const char * argv[]) {
    char sent[1000];
    scanf("%999[^\n]s", sent);
    prevero(sent);
    return 0;
}
